Revit 2027 API
ParameterTypeId.InfrastructureAlignmentDisplayedEndStation Property
 "Displayed End Station"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId InfrastructureAlignmentDisplayedEndStation { get; }
Public Shared ReadOnly Property InfrastructureAlignmentDisplayedEndStation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ InfrastructureAlignmentDisplayedEndStation {
	ForgeTypeId^ get ();
}
static member InfrastructureAlignmentDisplayedEndStation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace